{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Pepper__bell___Bacterial_spot",
    "1": "Pepper__bell___healthy",
    "2": "PlantVillage",
    "3": "Potato___Early_blight",
    "4": "Potato___Late_blight",
    "5": "Potato___healthy",
    "6": "Tomato_Bacterial_spot",
    "7": "Tomato_Early_blight",
    "8": "Tomato_Late_blight",
    "9": "Tomato_Leaf_Mold",
    "10": "Tomato_Septoria_leaf_spot",
    "11": "Tomato_Spider_mites_Two_spotted_spider_mite",
    "12": "Tomato__Target_Spot",
    "13": "Tomato__Tomato_YellowLeaf__Curl_Virus",
    "14": "Tomato__Tomato_mosaic_virus",
    "15": "Tomato_healthy"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Pepper__bell___Bacterial_spot": 0,
    "Pepper__bell___healthy": 1,
    "PlantVillage": 2,
    "Potato___Early_blight": 3,
    "Potato___Late_blight": 4,
    "Potato___healthy": 5,
    "Tomato_Bacterial_spot": 6,
    "Tomato_Early_blight": 7,
    "Tomato_Late_blight": 8,
    "Tomato_Leaf_Mold": 9,
    "Tomato_Septoria_leaf_spot": 10,
    "Tomato_Spider_mites_Two_spotted_spider_mite": 11,
    "Tomato__Target_Spot": 12,
    "Tomato__Tomato_YellowLeaf__Curl_Virus": 13,
    "Tomato__Tomato_mosaic_virus": 14,
    "Tomato_healthy": 15
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.56.1"
}
